app/controllers/products_controller.rb

	def index
		if params[:category].blank?
	  	@product = Product.all.order(params[:sort])
    else
    	@category_id = Category.find_by(name: params[:category]).id
    	if params[:sort]
    		@product = Product.where(category_id: @category_id).order(params[:sort])
    	else
    		@product = Product.where(category_id: @category_id).order("created_at ASC")
    	end
    	@category = Category.find(@category_id)
---
SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "electronics"], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		byebug
		@product = current_user.products.build(products_params)

		respond_to do |format|
			if @product.save

				if params[:images]
					params[:images].each { |image|
						@product.pictures.create(image: image, imageable_id: @product.id)
---
INSERT INTO "products" ("name", "description", "price", "on_sale", "sold_out", "featured", "quantity", "created_at", "updated_at", "category_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "pictures" ("created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "imageable_type", "imageable_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"